<!-- dflook/terraform-github-actions {"workspace":"repository_dispatch-2","backend_type":"remote","backend":"0de4ec18b86831f86180fe819f94ff31c55a537e4cfc615e5675c8a8c44097b9","plan_job_ref":"Job Test Terraform cloud #162 at https://github.com/dflook/terraform-github-actions/actions/runs/5389587929","plan_hash":"b2bd8681ebae9ca014dbf6dc14f0a7d3f055e47797341aaf40b7e488b386e6f4","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __repository_dispatch-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #162](https://github.com/dflook/terraform-github-actions/actions/runs/5389587929)